app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    if @article.update(articles_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "Here is a d\\\\\\cription "], ["updated_at", "2018-10-01 20:01:09.461571"], ["id", 4]]

  def create
    # binding.pry
    # render plain: params[:article].inspect
    @article = Article.new(articles_params)
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Here is another one"], ["description", "Here is a description "], ["created_at", "2018-09-28 20:43:44.692386"], ["updated_at", "2018-09-28 20:43:44.692386"]]